In [235]:
import pandas as pd

In [236]:
df = pd.read_csv('carprices.csv')

In [237]:
df.head()

  Car Model  Mileage  Sell Price($)  Age(yrs)
0    BMW X5    69000          18000         6
1    BMW X5    35000          34000         3
2    BMW X5    57000          26100         5
3    BMW X5    22500          40000         2
4    BMW X5    46000          31500         4

In [238]:
df.drop(['Car Model'],  axis='columns', inplace=True)

In [239]:
X = df.drop(['Sell Price($)'], axis='columns')
y = df['Sell Price($)']

In [240]:
X

    Mileage  Age(yrs)
0     69000         6
1     35000         3
2     57000         5
3     22500         2
4     46000         4
5     59000         5
6     52000         5
7     72000         6
8     91000         8
9     67000         6
10    83000         7
11    79000         7
12    59000         5

In [241]:
y

0     18000
1     34000
2     26100
3     40000
4     31500
5     29400
6     32000
7     19300
8     12000
9     22000
10    20000
11    21000
12    33000
Name: Sell Price($), dtype: int64

In [242]:
from sklearn.model_selection import train_test_split

In [243]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=10)

In [244]:
X_train.shape

(10, 2)

In [245]:
X_test.shape

(3, 2)

In [246]:
X_train

    Mileage  Age(yrs)
6     52000         5
8     91000         8
2     57000         5
12    59000         5
5     59000         5
10    83000         7
1     35000         3
0     69000         6
4     46000         4
9     67000         6

In [247]:
from sklearn.linear_model import LinearRegression
reg = LinearRegression()

In [248]:
reg.fit(X_train, y_train)

LinearRegression()

In [249]:
reg.score(X_test, y_test)

0.9224816911971746